<?php
// +----------------------------------------------------------------------
// | Tplay [ WE ONLY DO WHAT IS NECESSARY ]
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://tplay.pengyichen.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 听雨 < 389625819@qq.com >
// +----------------------------------------------------------------------

// 配置文件
return [ 
		'view_replace_str' => [ 
				'__CSS__' => '/static/admin/css',
				'__PUBLIC__' => '/static',
				'__JS__' => '/static/admin/js' 
		],
		'COOKIE_TIME' => 86400,
		'NATION' => array (
				'汉族',
				'回族',
				'满族',
				'朝鲜族',
				'白族',
				'土族',
				'土家族',
				'水族',
				'侗族',
				'壮族',
				'藏族',
				'彝族',
				'哈萨克族',
				'维吾尔族',
				'瑶族',
				'畲族',
				'苗族',
				'蒙古族',
				'傣族',
				'高山族',
				'哈尼族',
				'羌族',
				'俄罗斯族',
				'东乡族',
				'独龙族',
				'阿昌族',
				'保安族',
				'布朗族',
				'布依族',
				'达斡尔族',
				'德昂族',
				'鄂伦春族',
				'塔吉克族',
				'塔塔尔族',
				'佤族',
				'乌孜别克族',
				'锡伯族',
				'裕固族',
				'鄂温克族',
				'仡佬族',
				'赫哲族',
				'基诺族',
				'京族',
				'景颇族',
				'柯尔克孜族',
				'拉祜族',
				'黎族',
				'傈僳族',
				'珞巴族',
				'毛南族',
				'门巴族',
				'仫佬族',
				'纳西族',
				'怒族',
				'普米族',
				'撒拉族' 
		), // 民族
		'GENDER' => array (
				'男',
				'女' 
		), // 性别
		'DOMOCILE' => array (
				'非农业',
				'农业' 
		), // 户籍性质
		'ISMARRY' => array (
				'单身',
				'已婚',
				'离异' 
		), // 婚姻状况
		'PARTY' => array (
				'群众',
				'共产党员',
				'预备共产党员',
				'共青团员',
				'民革',
				'民盟',
				'民建',
				'民主促进',
				'农工民主党',
				'致公党',
				'九三学社',
				'台湾民主同盟',
				'无党派人士' 
		), // 政治面貌
		'ISHEAlTHY' => array (
				'健康',
				'一般',
				'较差' 
		), // 身体状况
		'ISILLEAGL' => array (
				'无',
				'有' 
		), // 有无违法
		'ISFRIEND' => array (
				'无',
				'有' 
		), // 公司有无亲友
		'LANGLEVEL' => array (
				'了解',
				'熟练',
				'精通' 
		), // 语言能力
		'SOURCE' => array (
				'前程无忧',
				'智联招聘',
				'猎头',
				'校园招聘',
				'公司网站',
				'猎聘网',
				'推荐',
				'人才市场',
				'纸媒体',
				'温州人才网',
				'58同城',
				'其他' 
		), // 招聘来源
		'FAMILYSHIP' => array (
				'配偶',
				'父母',
				'子女',
				'兄妹',
				'其他'
				/* '父母','岳父母','公婆','配偶','子女','未婚夫妻','姐弟','兄弟','兄妹','姐妹','祖父母','女婿','儿媳','其他' */
		),
		'ISDIPLOMA' => array (
				'有',
				'无' 
		),
		'EDURECORD' => array (
				'博士',
				'硕士',
				'本科',
				'大专',
				'高中（中专/中技/职高）',
				'初中',
				'小学' 
		),
		'SUBSIDY' => array (
				'餐饮',
				'通讯',
				'住房',
				'出差',
				'其他' 
		),
		'AGREEMENT' => array (
				'无',
				'有，森马不在其限制范围内',
				'有，森马处于其限制范围内' 
		),
		'WORKTIME' => array (
				'5天/周(22天/月)',
				'5.5天/周(24天/月)',
				'6天/周(26天/月)' 
		),
		'IMAGE_DOMAIN' => 'http://localhost:8600/',
		'_IMAGE_UPLOAD_URL_' => 'http://localhost:8600/recruit/Uploadweb/uploadImg',
		'_UPLOAD_PATH_PREFIX_' => 'uploads' 
];